Tekla Open API Reference for Tekla Structures 2025
Circle.Attributes Property
 The attributes of the circle.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Circle.CircleAttributes Attributes { get; set; }
Public Property Attributes As Circle.CircleAttributes
	Get
	Set
Property Value
Type: Circle.CircleAttributes
See Also
Reference
Circle Class
Tekla.Structures.Drawing Namespace